Revit 2026 API

# XYZMultiply(Double, XYZ) Operator

---

Multiplies the specified number and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ operator *(
	double value,
	XYZ right
)
```
```vb
Public Shared Operator * (
	value As Double,
	right As XYZ
) As XYZ
```
```cpp
public:
static XYZ^ operator *(
	double value,
	XYZ^ right
)
```
```fsharp
static let inline (*)
        value : float *
        right : XYZ  : XYZ
```

#### Parameters

value Double
    The value to multiply with the specified vector.
right XYZ
    The vector to multiply with the value.

#### Return Value

XYZThe multiplied vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when right is . |
| ArgumentException | Thrown when the specified value is an infinite number. |

The multiplied vector is obtained by multiplying each coordinate of the specified vector by the specified value.

#### Reference

XYZ Class

Multiply Overload

Autodesk.Revit.DB Namespace